Ran Plan for project: `Set_EKS_Auth` dir: `.` workspace: `Set_EKS_Auth`

<details><summary>Show Output</summary>

```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/findnull/Set_EKS_Auth/runs/run-G8PAdZsiN2tLyNoG

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.iam_for_eks.module.eks_admins_iam_group.data.aws_partition.current: Refreshing...
module.iam_for_eks.module.eks_admins_iam_role.data.aws_partition.current: Refreshing...
module.iam_for_eks.data.aws_vpc.vpc_eks: Refreshing...
module.iam_for_eks.module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Refreshing...
data.aws_eks_cluster.default: Refreshing...
module.iam_for_eks.module.eks_admins_iam_role.data.aws_caller_identity.current: Refreshing...
module.iam_for_eks.module.eks_admins_iam_group.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.iam_for_eks.module.eks_admins_iam_role.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.iam_for_eks.module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=213321518471]
module.iam_for_eks.module.eks_admins_iam_role.data.aws_caller_identity.current: Refresh complete after 0s [id=213321518471]
module.iam_for_eks.module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Refreshing...
module.iam_for_eks.module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Refresh complete after 0s [id=683860886]
data.aws_eks_cluster.default: Refresh complete after 1s [id=eks-coba2]
module.iam_for_eks.data.aws_vpc.vpc_eks: Refresh complete after 2s [id=vpc-0472bd9a47b939621]
module.iam_for_eks.module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Refreshing...
module.iam_for_eks.module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Refresh complete after 0s [id=4293489343]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.iam_for_eks.module.allow_eks_access_policy.aws_iam_policy.policy[0] will be created
+ resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Alow EKS Access Policy"
      + id          = (known after apply)
      + name        = "allow-eks-access"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_for_eks.module.assume_eks_admin_iam_policy.aws_iam_policy.policy[0] will be created
+ resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "IAM Policy"
      + id          = (known after apply)
      + name        = "assume-eks-admin-iam-role"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.iam_for_eks.module.eks_admins_iam_group.aws_iam_group.this[0] will be created
+ resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks-admin"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.iam_for_eks.module.eks_admins_iam_group.aws_iam_group_membership.this[0] will be created
+ resource "aws_iam_group_membership" "this" {
      + group = (known after apply)
      + id    = (known after apply)
      + name  = "eks-admin"
      + users = [
          + "kubeuser",
        ]
    }

  # module.iam_for_eks.module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0] will be created
+ resource "aws_iam_group_policy_attachment" "custom_arns" {
      + group      = (known after apply)
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.iam_for_eks.module.eks_admins_iam_role.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::213321518471:root"
                          + Service = []
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_for_eks.module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0] will be created
+ resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-admin"
    }

  # module.iam_for_eks.module.user1_iam_kubeuser.aws_iam_user.this[0] will be created
+ resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "kubeuser"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ check_cluster_name = "eks-coba2"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p Set_EKS_Auth`
* :put_litter_in_its_place: To **delete** this plan click [here](https://abcdef.nizarakbar.com/lock?id=nizarakbarm%252FSet_EKS_Auth%252F.%252FSet_EKS_Auth)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p Set_EKS_Auth`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`